src_ext/Catalogs/УЗ_Абонемент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>УЗ_Абонемент</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗанятий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктивации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаАбонемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Приостановки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПриостановки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВозобновления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзменения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_ext/Catalogs/УЗ_Абонемент/Ext/ObjectModule.bsl
Процедура ПриКопировании(ОбъектКопирования)
	ДатаНачала = Неопределено;
	ДатаОкончания = Неопределено;
	Активный = Неопределено;
	КоличествоЗанятий = Неопределено;
	КоличествоЧасов = Неопределено;
	Комментарий = Неопределено;
КонецПроцедуры

//Наименование обязательно и уникально — не заполнили руками, составляем сами (до проверки заполнения).
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ПустаяСтрока(Наименование) Тогда
		Наименование = Справочники.УЗ_Абонемент.АвтоНаименование(ФизЛицо, ДатаНачала, Ссылка);
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЗначениеЗаполнено(ДатаНачала) и ДатаНачала > ДатаОкончания Тогда
		Сообщить("Ошибка! Дата начала больше даты окончания!");
		Отказ = Истина;
	КонецЕсли;
	
	Если Активный Тогда
		
		// Проверка по дате начала
		Для Каждого СтрПриостановка из Приостановки Цикл 			
			Если ДатаНачала > СтрПриостановка.ДатаПриостановки или ДатаОкончания < СтрПриостановка.ДатаВозобновления или СтрПриостановка.ДатаПриостановки >= СтрПриостановка.ДатаВозобновления Тогда
				Сообщить("Ошибка в датах приостановок! Строка: " +СтрПриостановка.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;			
		КонецЦикла;
		
		// Проверка по пересечениям приостановок
		Для Каждого ПроверяемаяПриостановка из Приостановки Цикл 			
			
			Для Каждого СтрПриостановка из Приостановки Цикл 			
				
				Если ПроверяемаяПриостановка.НомерСтроки = СтрПриостановка.НомерСтроки Тогда
					Продолжить;
				КонецЕсли;
				
				Если ПроверяемаяПриостановка.ДатаПриостановки >= СтрПриостановка.ДатаПриостановки и ПроверяемаяПриостановка.ДатаПриостановки < СтрПриостановка.ДатаВозобновления Тогда
					Сообщить("Ошибка в датах приостановок! Строка: " +СтрПриостановка.НомерСтроки);
					Отказ = Истина;
				КонецЕсли;
				Если ПроверяемаяПриостановка.ДатаВозобновления >= СтрПриостановка.ДатаПриостановки и ПроверяемаяПриостановка.ДатаВозобновления < СтрПриостановка.ДатаВозобновления Тогда
					Сообщить("Ошибка в датах приостановок! Строка: " +СтрПриостановка.НомерСтроки);
					Отказ = Истина;
				КонецЕсли;
			КонецЦикла;		
		КонецЦикла;
	КонецЕсли;             	

КонецПроцедуры
